In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("D:\\resources\\sms_analysis\\call_info\\call_record.csv")

In [4]:
bill_month = pd.read_csv("D:\\resources\\sms_analysis\\call_info\\bill_month.csv")

In [12]:
bg = bill_month.groupby(by=['id'])

id
420117199511297566    6
452428198905121238    5
Name: month, dtype: int64

In [7]:
bg.sum()

                          total_fee
id                 month
420117199511297566 4          13080
                   5          16854
                   6          26000
                   7          10641
                   8           8950
                   9           5930
452428198905121238 6           6005
                   7          17663
                   8          14476
                   9          23312
                   10         23275

In [8]:
bg['id']

In [10]:
bg['id'].sum()

id                  month
420117199511297566  4        420117199511297536
                    5        420117199511297536
                    6        420117199511297536
                    7        420117199511297536
                    8        420117199511297536
                    9        420117199511297536
452428198905121238  6        452428198905121216
                    7        452428198905121216
                    8        452428198905121216
                    9        452428198905121216
                    10       452428198905121216
Name: id, dtype: int64

In [11]:
df.describe()

                 id       month   call_time   call_number  call_cost
count  4.940000e+02  494.000000  494.000000  4.940000e+02      494.0
mean   4.201172e+17    7.147773   59.082996  1.507043e+10        0.0
std    4.740801e+03    1.596276   77.179299  1.784637e+10        0.0
min    4.201172e+17    5.000000    3.000000  1.000000e+04        0.0
25%    4.201172e+17    6.000000   21.000000  1.312510e+10        0.0
50%    4.201172e+17    7.000000   36.000000  1.537769e+10        0.0
75%    4.201172e+17    8.750000   65.000000  1.804056e+10        0.0
max    4.201172e+17   10.000000  637.000000  3.393708e+11        0.0